*&---------------------------------------------------------------------*
*& Report YE03_EX027
*&---------------------------------------------------------------------*
*& 자동차 함수그룹 호출 프로그램
*&---------------------------------------------------------------------*
REPORT YE03_EX027.


" 자동차의 속도를 기록할 전역변수
DATA MY_CAR_SPEED TYPE I.
"
DATA

  START-OF-SELECTION.

CALL FUNCTION 'Y_E03_GET_SPEED'
  IMPORTING
    EV_SPEED = MY_CAR_SPEED. " 자동차의 현재속도

WRITE : / '자동차의 현재속도는', MY_CAR_SPEED, '입니다.'.
*--------------------------------------------------------------------*
* 속도 증가
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_INC_SPEED'
  EXPORTING
    IV_SPEED = 30.  " 현재 속도에서 얼마나 더 증가시킬건지?
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_GET_SPEED'
  IMPORTING
    EV_SPEED = MY_CAR_SPEED. " 자동차의 현재속도
*--------------------------------------------------------------------*
WRITE : / '자동차의 현재속도는', MY_CAR_SPEED, '입니다.'.

*--------------------------------------------------------------------*
* 속도 감소
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_DEC_SPEED'
  EXPORTING
    IV_SPEED = 10.  " 속도를 얼마나 감소시킬 건지?
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_GET_SPEED'
  IMPORTING
    EV_SPEED = MY_CAR_SPEED. " 자동차의 현재속도
*--------------------------------------------------------------------*
WRITE : / '자동차의 현재속도는', MY_CAR_SPEED, '입니다.'.
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_DEC_SPEED'
  EXPORTING
    IV_SPEED = 60.  " 속도를 얼마나 감소시킬 건지?
                    " IV_SPEED > EV_SPEED 이기에 DEC 함수모듈의 IF문을
                    " 통해 0이 출력되게 됨
*--------------------------------------------------------------------*
CALL FUNCTION 'Y_E03_GET_SPEED'
  IMPORTING
    EV_SPEED = MY_CAR_SPEED. " 자동차의 현재속도
*--------------------------------------------------------------------*
WRITE : / '자동차의 현재속도는', MY_CAR_SPEED, '입니다.'.
